app/views/contacts/_form.html.erb

    <%= form.label :group_id %>
    <%= form.select :group_id,options_for_select(Group.all.collect {|p| [ p.name, p.id ] }, { include_blank: true }) ,id: :contact_group_id %>
---
SELECT "groups".* FROM "groups"