app/controllers/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE (contacts.user_id =4 and name like ='A') LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "contacts" WHERE (contacts.user_id =4 and name like '%rickie@hotmail.com	%' or email like '%rickie@hotmail.com	%')
---
  def index
    if request.GET['filterLetter']
      @contacts = Contact.my_contacts current_user, :letter => request.GET['filterLetter']
    elsif request.GET['favorites']
      @contacts = Contact.my_contacts current_user, :favorites => true
    elsif request.GET['q']
      @contacts = Contact.my_contacts current_user, :search => request.GET['q']
    elsif request.GET['filterNumber']
      @contacts = Contact.my_contacts current_user, :number => request.GET['filterNumber']
    else
      @contacts = Contact.my_contacts current_user
    end
    @contacts = @contacts.paginate(:page => params[:page], :per_page => 10)

INSERT INTO "contacts" ("name", "email", "phone", "cell", "des", "birthdate", "group_id", "user_id", "street", "city", "zipcode", "img_url", "country", "created_at", "updated_at", "favorites") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contact = current_user.contacts.build(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "des" = ?, "img_url" = ?, "favorites" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["des", ""], ["img_url", ""], ["favorites", "f"], ["updated_at", "2018-09-04 17:41:25.738837"], ["id", 32]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)