app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "family"], ["created_at", "2018-08-26 19:53:27.590117"], ["updated_at", "2018-08-26 19:53:27.590117"]]